# Задайте список из n чисел последовательности 
# $(1+\frac 1 n)^n$ и выведите на экран их сумму.
# Пример:
# - Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}

N = int(input('Введите число N:'))
ListSum = [(1+1/i)**i for i in range(1,N+1)]
print('Сумма: {}'.format(round(sum(ListSum),2)))